<a href="https://colab.research.google.com/github/Echevarriaj93/Data_in_Motion_weeklies/blob/main/DIMweek4PandasChallenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Data In Motion Week 4 Pandas Challenge**

## Questions

1. See the first 10 entries.
2. Delete the columns 'Unnamed: 0' and 'Id'.
3. Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.
4. How many different names exist in the dataset?
5. What is the name with most occurrences?
6. What is the standard deviation of count of names?
7. Get a summary of the dataset with the mean, min, max, std and quartiles.


Data: https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

In [ ]:
#### Importing dependencies

import pandas as pd
import numpy as np

## **Preparing for Analysis**

In [ ]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

data = pd.read_csv(url)

data.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [43]:
# About 1 million rows and 7 columns
data.shape

(1016395, 7)

In [45]:
# There are no NaN values in this dataset
data.isnull().sum()

Unnamed: 0    0
Id            0
Name          0
Year          0
Gender        0
State         0
Count         0
dtype: int64

In [27]:
 #Since Ids are unique we can assume we do not need to remove duplicates
data['Id'].value_counts()

11350      1
3849769    1
3849756    1
3849757    1
3849758    1
          ..
1803129    1
1803130    1
1803131    1
1803132    1
5647426    1
Name: Id, Length: 1016395, dtype: int64

## **1. See the first 10 entries.**

In [ ]:
data.head(10) # Head gets the top 5 rows by default

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

## **2. Delete the columns 'Unnamed: 0' and 'Id'.**

In [ ]:
# As good defensive practice we should make a copy of the original data 
# as opposed to making chnages to it directly
df = data.copy()

In [30]:
 # dropping specified columns in a list and specifying the axis (columns)
df.drop(columns=['Unnamed: 0', 'Id'], axis=1, inplace= True)

## **3. Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.**

In [31]:
 #Value_counts will group the unique values of a specified column
names = df['Name'].value_counts()

#Value_counts will also automatically sort in desc order.
names.head()

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

## **4. How many different names exist in the dataset?**

In [32]:
#Number of unique values are easily aggregated with nunique() function
df['Name'].nunique()

17632

## **5. What is the name with most occurrences?**

## The name with the most occurences in this set is Riley. We can see this because it is displayed as the top result in value_counts()

## **6. What is the standard deviation of count of names?**

In [33]:
names.values.std()

122.02650299050643

## **7. Get a summary of the dataset with the mean, min, max, std and quartiles.**

In [34]:
#describe() will pull and display the summary statistics for the series or dataframe
df.describe() 

# The data overall seems well normalized. We don't see signs of outlier as the Max values
#all seem to be within reasonable ranges considering the middle 50% of the data 
# are roughly around the mean. the 75% percentile helps to show the Max values are not extreme

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03